storeData = {
  products: [
    {
      name: "Reno15 F",
      variants: [
        { spec: "8GB / 256GB", price: 11999 },
        { spec: "12GB / 256GB", price: 12999 }
      ],
      promo: [
        "จอง500ลด500",
        "ประกันเปลียนเครื่องใหม่180วัน",
        "ประกันตัวเครื่อง2ปี",
        "ประกันจอแตก2ปี1ครั้ง",
        "ประกันซอฟต์แวร์ 7ปี",
        "อัพOSได้นาน 4เวอร์ชั่น",
        "Trede Up รุ่นที่รวมรายการสูงสุด5,000",
        "Trede Up รุ่นที่ไม่รวมรายการสูงสุด1,000"
      ]
    },
    {
      name: "Reno15 5G",
      variants: [
        { spec: "12GB / 256GB", price: 16999 },
        { spec: "12GB / 512GB", price: 18999 }
      ],
      promo: [
        "จอง500ลด500",
        "ประกันเปลียนเครื่องใหม่180วัน",
        "ประกันตัวเครื่อง2ปี",
        "ประกันจอแตก2ปี1ครั้ง",
        "ประกันซอฟต์แวร์ 7ปี",
        "อัพOSได้นาน 4เวอร์ชั่น",
        "Trede Up รุ่นที่รวมรายการสูงสุด5,000",
        "Trede Up รุ่นที่ไม่รวมรายการสูงสุด1,000"
      ]
    },
    {
      name: "Reno15 Pro",
      variants: [
        { spec: "12GB / 256GB", price: 20999 }
      ],
      promo: [
        "จอง500ลด500",
        "ประกันเปลียนเครื่องใหม่180วัน",
        "ประกันตัวเครื่อง2ปี",
        "ประกันจอแตก2ปี1ครั้ง",
        "ประกันซอฟต์แวร์ 7ปี",
        "อัพOSได้นาน 4เวอร์ชั่น",
        "Trede Up รุ่นที่รวมรายการสูงสุด5,000",
        "Trede Up รุ่นที่ไม่รวมรายการสูงสุด1,000"
      ]
    },
    {
      name: "Reno15 Pro Max",
      variants: [
        { spec: "12GB / 512GB", price: 24999 }
      ],
      promo: [
        "จอง500ลด500",
        "ประกันเปลียนเครื่องใหม่180วัน",
        "ประกันตัวเครื่อง2ปี",
        "ประกันจอแตก2ปี1ครั้ง",
        "ประกันซอฟต์แวร์ 7ปี",
        "อัพOSได้นาน 4เวอร์ชั่น",
        "Trede Up รุ่นที่รวมรายการสูงสุด5,000",
        "Trede Up รุ่นที่ไม่รวมรายการสูงสุด1,000"
      ]
    }
  ]
};
