storeData = {
  products: [
    {
      name: "Reno15 F",
      variants: [
        { spec: "8GB / 256GB", price: 11999 },
        { spec: "12GB / 256GB", price: 12999 }
      ],
      promo: [
        "จอง500ลด500",
        "ประกันเปลียนเครื่องใหม่180วัน",
        "ประกันตัวเครื่อง2ปี",
        "ประกันจอแตก2ปี1ครั้ง",
        "ประกันซอฟต์แวร์ 7ปี",
        "อัพOSได้ 5เวอร์ชั่น ใน6ปี",
        "Trede Up รุ่นที่รวมรายการสูงสุด4,000",
        "Trede Up รุ่นที่ไม่รวมรายการสูงสุด1,000",
        "[ของแถม8/256g]",
        " ของแถมร้าน หรือ My Choice 500 Thd + หูฟังEnco Bud3 มูลค่า799.-",
        "[ของแถม12/256g]",
        " ของแถมร้าน หรือ My Choice 500 Thd + หูฟังEnco Bud3 มูลค่า799.-",
      ]
    },
    {
      name: "Reno15 5G",
      variants: [
        { spec: "12GB / 256GB", price: 16999 },
        { spec: "12GB / 512GB", price: 18999 }
      ],
      promo: [
        "จอง500ลด500",
        "ประกันเปลียนเครื่องใหม่180วัน",
        "ประกันตัวเครื่อง2ปี",
        "ประกันจอแตก2ปี1ครั้ง",
        "ประกันซอฟต์แวร์ 7ปี",
        "อัพOSได้ 5เวอร์ชั่น ใน6ปี",
        "Trede Up รุ่นที่รวมรายการสูงสุด4,000",
        "Trede Up รุ่นที่ไม่รวมรายการสูงสุด1,000",
        "[ของแถม12/256g]",
        "ของแถมร้าน หรือ My Choice 700 Thd + หูฟังEnco Bud3Pro มูลค่า999.-",
        "[ของแถม12/512g]",
        " ของแถมร้าน หรือ My Choice 700 Thd + หูฟังEnco Bud3Pro มูลค่า999.-"
      ]
    },
    {
      name: "Reno15 Pro",
      variants: [
        { spec: "12GB / 256GB", price: 20999 }
      ],
      promo: [
        "จอง500ลด500",
        "ประกันเปลียนเครื่องใหม่180วัน",
        "ประกันตัวเครื่อง2ปี",
        "ประกันจอแตก2ปี1ครั้ง",
        "ประกันซอฟต์แวร์ 7ปี",
        "อัพOSได้ 5เวอร์ชั่น ใน6ปี",
        "Trede Up รุ่นที่รวมรายการสูงสุด4,000",
        "Trede Up รุ่นที่ไม่รวมรายการสูงสุด1,000",
        "[ของแถม12/256g]",
        "ของแถมร้าน หรือ My Choice 800 Thd + หูฟังEnco Air4 มูลค่า1,999.-"
      ]
    },
    {
      name: "Reno15 Pro Max",
      variants: [
        { spec: "12GB / 512GB", price: 24999 }
      ],
      promo: [
        "จอง500ลด500",
        "ประกันเปลียนเครื่องใหม่180วัน",
        "ประกันตัวเครื่อง2ปี",
        "ประกันจอแตก2ปี1ครั้ง",
        "ประกันซอฟต์แวร์ 7ปี",
        "อัพOSได้ 5เวอร์ชั่น ใน6ปี",
        "Trede Up รุ่นที่รวมรายการสูงสุด4,000",
        "Trede Up รุ่นที่ไม่รวมรายการสูงสุด1,000",
        "[ของแถม12/512g]",
        "ของแถมร้าน หรือ My Choice 1,000 Thd + หูฟังEnco Air4 มูลค่า1,999.-"
      ]
    }
  ]
};
